{
    "Apply Now": "Comenzar aplicación",
    "Begin your dream now!": "¡Comienza tu sueño ahora!",
    "Supercharge your future with a degree from URBE University. We work closely with you to ensure you are well-informed throughout your application process. Start your application today, or give us a call. We are ready for you.": "Impulsa tu futuro con un título de URBE University. Trabajamos en estrecha colaboración contigo para garantizar que estés bien informado durante todo el proceso de admisión. Comience su aplicación hoy o llámenos. Estamos listos para ti.",
    "Talk to admissions": "Hablar con admisiones",
    "What is the application process like?": "¿Cómo es el proceso de admisión?",
    "Prepare": "Preparación",
    "Review your requirements": "Revise sus requisitos",
    "Before you start your application, please take a moment to review your program-specific requirements.": "Antes de comenzar su aplicación, tómese un momento para revisar los requisitos específicos de acuerdo a su programa de interés.",
    "Bachelor's requirements": "Requisitos de las licenciaturas",
    "Master's requirements": "Requisitos de las maestrías",
    "Apply": "Aplique",
    "Fill out your application": "Complete su aplicación",
    "Once you have all the necessary documents and information, start by completing your online application to URBE University.": "Una vez que tenga todos los documentos e información necesarios, debe completar su aplicación en línea a URBE University.",
    "Get admitted": "Obtener admisión",
    "Application review": "Revisión de la aplicación",
    "After you submit your application, it will be reviewed by our Admissions and Academic departments, and you should be hearing back from us within 24 hours of your application. If you have any questions, please schedule a call with our Admissions team.": "Después de enviar su solicitud, será revisada por nuestros departamentos de Admisiones y Académico, y debería recibir una respuesta nuestra dentro de las 24 horas posteriores a su solicitud. Si tiene alguna pregunta, programe una llamada con nuestro equipo de admisiones.",
    "Tuition and aid": "Matrícula",
    "Meet with your financial and academic advisors": "Reúnase con sus asesores financieros y académicos",
    "Once you are admitted, we will coordinate meetings with your academic and financial advisors, so that they can go over your classes schedule, and financial responsibilities respectively.": "Una vez que seas admitido, coordinaremos reuniones con tus asesores académicos y financieros, para que puedan revisar tu horario de clases y responsabilidades financieras, respectivamente.",
    "Onboard and Go": "Listo para comenzar",
    "Start classes on the next academic period": "Comience sus clases en el próximo período académico",
    "Congratulations! You are now officially ready to start classes at URBE University. At this point, you will receive information about how to navigate URBE's learning environments. With this you will be ready to start on the next academic period.": "¡Felicidades! Ya estás oficialmente listo para iniciar clases en la Universidad URBE. En este punto, recibirá información sobre cómo navegar por los entornos de aprendizaje de URBE. Con esto estarás listo para iniciar el próximo período académico.",
    "All Rights Reserved": "Todos los derechos reservados",
    "Contact details": "Información de contacto",
    "First Name": "Nombre",
    "Middle Name": "Segundo Nombre",
    "Last Name": "Apellido(s)",
    "Do you have any previous legal names?": "¿Tiene algún nombre legal anterior?",
    "If you have any previous names, such as a maiden name, please let us know. It helps when requesting transcripts from previous schools where your name might be different.": "Si tiene nombres anteriores, como un apellido de soltero, háganoslo saber. Ayuda cuando solicita transcripciones de escuelas anteriores donde su nombre puede ser diferente.",
    "Yes": "Si",
    "No": "No",
    "Previous First Name": "Nombre anterior",
    "Previous Middle Name": "Segundo nombre anterior",
    "Previous Last Name": "Apellido(s) anterior(es)",
    "Enter your email address": "Ingrese su dirección de correo electrónico",
    "Confirm your email address": "Confirme su dirección de correo electrónico",
    "By entering your email address you are consenting to the University sending you notifications, updates, requests for information, and/or marketing information concerning URBE University.": "Al ingresar su dirección de correo electrónico, usted está dando su consentimiento para que la Universidad le envíe notificaciones, actualizaciones, solicitudes de información y/o información de mercadeo sobre URBE University.",
    "Select your country code": "Seleccione el código de su país",
    "Enter your phone number": "Ingrese su número telefónico",
    "Postal address": "Direccion postal",
    "Postal address line 2": "Dirección postal (continuado)",
    "City/Municipality": "Ciudad/Municipio",
    "State/Province": "Estado/Provincia",
    "Zip/Postal code": "Código postal",
    "Country": "País",
    "By clicking 'Continue' you are giving your express written consent for URBE University to contact you for marketing purposes concerning its educational programs and services using automated technology for calls and periodic texts to any number you provide. Message and data rates may apply. This consent is not required to purchase goods and services. This consent is not required to complete an application for admission to URBE University. If you wish to complete an application for admission without providing this consent, please request information by contacting the University directly at (844) 744-URBE. If you no longer wish to receive marketing text messages, reply STOP to cancel such future text messages. If you no longer wish to receive automated marketing phone calls, you may opt out by expressing your preference to an enrollment representative or by emailing optmeout@urbe.university": "Al hacer clic en 'Continuar', está dando su consentimiento expreso por escrito para que URBE University se comunique con usted con fines de mercadeo con respecto a sus programas y servicios educativos utilizando tecnología automatizada para llamadas y mensajes de texto periódicos a cualquier número que proporcione. Se pueden aplicar tarifas por mensajes y datos. Este consentimiento no es necesario para comprar bienes y servicios. Este consentimiento no es necesario para completar una solicitud de admisión a URBE University. Si desea completar una solicitud de admisión sin proporcionar este consentimiento, solicite información comunicándose directamente con la Universidad al +1(844)-744-URBE. Si ya no desea recibir mensajes de texto de marketing, responda STOP para cancelar dichos mensajes de texto futuros. Si ya no desea recibir llamadas telefónicas de marketing automatizadas, puede optar por no expresar su preferencia a un representante de inscripción o enviar un correo electrónico a optmeout@urbe.university",
    "Continue": "Continuar",
    "Select": "Seleccionar",
    "Need help?": "Necesita ayuda?",
    "Send us an email": "Envíanos un email",
    "Give us a call": "Llámenos"
}
