{
    "Apply Now": "Aplicar ahora!",
    "Begin your dream now!": "¡Comienza tu sueño ahora!",
    "Supercharge your future with a degree from URBE University. We work closely with you to ensure you are well-informed throughout your application process. Start your application today, or give us a call. We are ready for you.": "Impulsa tu futuro con un título de URBE University. Trabajamos en estrecha colaboración contigo para garantizar que estés bien informado durante todo el proceso de admisión. Comience su aplicación hoy o llámenos. Estamos listos para ti.",
    "Talk to admissions": "Hablar con admisiones",
    "What is the application process like?": "¿Cómo es el proceso de admisión?",
    "Prepare": "Preparación",
    "Review your requirements": "Revise sus requisitos",
    "Before you start your application, please take a moment to review your program-specific requirements.": "Antes de comenzar su aplicación, tómese un momento para revisar los requisitos específicos de acuerdo a su programa de interés.",
    "Bachelor's requirements": "Requisitos de las licenciaturas",
    "Master's requirements": "Requisitos de las maestrías",
    "Apply": "Aplique",
    "Fill out your application": "Complete su aplicación",
    "Once you have all the necessary documents and information, start by completing your online application to URBE University.": "Una vez que tenga todos los documentos e información necesarios, debe completar su aplicación en línea a URBE University.",
    "Get admitted": "Obtener admisión",
    "Application review": "Revisión de la aplicación",
    "After you submit your application, it will be reviewed by our Admissions and Academic departments, and you should be hearing back from us within 24 hours of your application. If you have any questions, please schedule a call with our Admissions team.": "Después de enviar su solicitud, será revisada por nuestros departamentos de Admisiones y Académico, y debería recibir una respuesta nuestra dentro de las 24 horas posteriores a su solicitud. Si tiene alguna pregunta, programe una llamada con nuestro equipo de admisiones.",
    "Tuition and aid": "Matrícula",
    "Meet with your financial and academic advisors": "Reúnase con sus asesores financieros y académicos",
    "Once you are admitted, we will coordinate meetings with your academic and financial advisors, so that they can go over your classes schedule, and financial responsibilities respectively.": "Una vez que seas admitido, coordinaremos reuniones con tus asesores académicos y financieros, para que puedan revisar tu horario de clases y responsabilidades financieras, respectivamente.",
    "Onboard and Go": "Listo para comenzar",
    "Start classes on the next academic period": "Comience sus clases en el próximo período académico",
    "Congratulations! You are now officially ready to start classes at URBE University. At this point, you will receive information about how to navigate URBE's learning environments. With this you will be ready to start on the next academic period.": "¡Felicidades! Ya estás oficialmente listo para iniciar clases en URBE University. En este punto, recibirá información sobre cómo navegar por los entornos de aprendizaje de URBE. Con esto estarás listo para iniciar el próximo período académico.",
    "All Rights Reserved": "Todos los derechos reservados",
    "Contact details": "Información de contacto",
    "First Name": "Nombre",
    "Middle Name": "Segundo Nombre",
    "Last Name": "Apellido(s)",
    "Do you have any previous legal names?": "¿Tiene algún nombre legal anterior?",
    "If you have any previous names, such as a maiden name, please let us know. It helps when requesting transcripts from previous schools where your name might be different.": "Si tiene nombres anteriores, como un apellido de soltero, háganoslo saber. Ayuda cuando solicita transcripciones de escuelas anteriores donde su nombre puede ser diferente.",
    "Yes": "Si",
    "No": "No",
    "Previous First Name": "Nombre anterior",
    "Previous Middle Name": "Segundo nombre anterior",
    "Previous Last Name": "Apellido(s) anterior(es)",
    "Enter your email address": "Ingrese su dirección de correo electrónico",
    "Confirm your email address": "Confirme su dirección de correo electrónico",
    "By entering your email address you are consenting to the University sending you notifications, updates, requests for information, and/or marketing information concerning URBE University.": "Al ingresar su dirección de correo electrónico, usted está dando su consentimiento para que la Universidad le envíe notificaciones, actualizaciones, solicitudes de información y/o información de mercadeo sobre URBE University.",
    "Select your country code": "Seleccione el código de su país",
    "Enter your phone number": "Ingrese su número telefónico",
    "Postal address": "Direccion postal",
    "Postal address line 2": "Dirección postal (continuado)",
    "City/Municipality": "Ciudad/Municipio",
    "State/Province": "Estado/Provincia",
    "Zip/Postal code": "Código postal",
    "Country": "País",
    "By clicking 'Continue' you are giving your express written consent for URBE University to contact you for marketing purposes concerning its educational programs and services using automated technology for calls and periodic texts to any number you provide. Message and data rates may apply. This consent is not required to purchase goods and services. This consent is not required to complete an application for admission to URBE University. If you wish to complete an application for admission without providing this consent, please request information by contacting the University directly at (844) 744-URBE. If you no longer wish to receive marketing text messages, reply STOP to cancel such future text messages. If you no longer wish to receive automated marketing phone calls, you may opt out by expressing your preference to an enrollment representative or by emailing optmeout@urbe.university": "Al hacer clic en 'Continuar', está dando su consentimiento expreso por escrito para que URBE University se comunique con usted con fines de mercadeo con respecto a sus programas y servicios educativos utilizando tecnología automatizada para llamadas y mensajes de texto periódicos a cualquier número que proporcione. Se pueden aplicar tarifas por mensajes y datos. Este consentimiento no es necesario para comprar bienes y servicios. Este consentimiento no es necesario para completar una solicitud de admisión a URBE University. Si desea completar una solicitud de admisión sin proporcionar este consentimiento, solicite información comunicándose directamente con la Universidad al +1(844)-744-URBE. Si ya no desea recibir mensajes de texto de marketing, responda STOP para cancelar dichos mensajes de texto futuros. Si ya no desea recibir llamadas telefónicas de marketing automatizadas, puede optar por no expresar su preferencia a un representante de inscripción o enviar un correo electrónico a optmeout@urbe.university",
    "Continue": "Continuar",
    "Select": "Seleccionar",
    "Need help?": "Necesita ayuda?",
    "Send us an email": "Envíanos un email",
    "Give us a call": "Llámenos",
    "Personal Information": "Información personal",
    "Gender": "Sexo",
    "Ethnicity": "Etnicidad",
    "Date of birth": "Fecha de nacimiento (ingrese mes/día/año)",
    "Are you a U.S citizen or resident?": "¿Eres ciudadano o residente de los Estados Unidos?",
    "SSN (last four digits)": "SSN (últimos cuatro dígitos)",
    "Your Social Security Number helps us collect your transcripts and is needed to process financial information. It will may also assist the University in preparing important tax documents help you when you file income taxes in the future.": "Su Número de Seguro Social nos ayuda a recopilar sus transcripciones y es necesario para procesar su información financiera. También puede ayudar a la Universidad a la hora de preparar documentos impositivos importantes que lo ayuden cuando presente declaraciones de impuestos en el futuro.",
    "Drivers License/Passport": "Licencia de conducir/pasaporte",
    "Please only enter valid drivers license or passport number.": "Ingrese solo una licencia de conducir válida o un número de pasaporte.",
    "Are you a current or former member of the U.S. Armed Forces, or a dependent, spouse or widow of a member of the U.S. Armed Forces?": "¿Es usted un miembro actual o anterior de las Fuerzas Armadas de los EE. UU., o un dependiente, cónyuge o viuda de un miembro de las Fuerzas Armadas de los EE. UU.?",
    "If you're associated with the military, you may be eligible for special tuition rates.": "Si está asociado con las fuerzas armadas, puede ser elegible para tasas de matrícula especiales.",
    "Are you employed as a civilian with the Department of Defense or the Coast Guard?": "¿Está empleado como civil en el Departamento de Defensa o en la Guardia Costera?",
    "Female": "Femenino",
    "Male": "Masculino",
    "Non binary": "No binario",
    "select one": "Seleccionar",
    "Continue later": "Guardar y continuar mas tarde",
    "Save application": "Guardar aplicación",
    "We will save your application and send you an email with a link that you can use to continue later.": "Guardaremos su aplicación y le enviaremos un correo electrónico con un enlace que puede usar para continuar más tarde.",
    "Please notice that only progress made until this point will be saved. When you come back, you will need to complete this page again.": "Tenga en cuenta que solo se guardará el progreso realizado hasta este punto. Cuando regrese, deberá completar esta página nuevamente.",
    "Cancel": "Cancelar",
    "Select your program of interest": "Seleccione su programa de interés",
    "What degree level are you seeking?": "¿Qué nivel de grado estás buscando?",
    "When would you like to start classes?": "¿Cuándo le gustaría empezar las clases?",
    "An admissions representative will work with you to determine your actual start date.": "Un representante de admisiones trabajará con usted para determinar su fecha de inicio real.",
    "Are you applying for an online or on-campus program?": "¿Está solicitando un programa en línea o presencial?",
    "Please pick the language you would like to complete your program on?": "Elija el idioma en el que le gustaría completar su programa.",
    "What program are you seeking?": "¿Qué programa estás buscando?",
    "What concentration interests you?": "¿Qué concentración estás interesado?",
    "On-campus": "Presencial",
    "Online": "En línea",
    "English": "Inglés",
    "Spanish": "Español",
    "Education background": "Antecedentes educativos",
    "Highschool/secondary Education": "Educación Secundaria",
    "If you received an alternative diploma or a diploma other than a high school diploma, please select 'Other'. In the U.S, this is high school or GED; outside the U.S., this can be high school, lyceum, gymnasium or secondary school.": "Si recibió un diploma alternativo o un diploma que no sea un diploma de escuela secundaria, seleccione 'Otro'. En los EE. UU., esto es la escuela secundaria o GED; fuera de los EE. UU., puede ser la escuela secundaria, el liceo, el gimnasio o la escuela secundaria.",
    "School name": "Nombre de la escuela",
    "School city": "Ciudad de la escuela",
    "School country": "País de la escuela",
    "Date of completion": "Fecha de finalización",
    "Have you taken courses at a college or university, technical or trade school, or other higher education institution?": "¿Ha tomado cursos en un colegio o universidad, escuela técnica o comercial, u otra institución de educación superior?",
    "The actual value of your credits - particularly those earned through testing programs, trade schools, military education and non-North American schools, for example -- will be manually assessed and verified, and can impact your tuition and fees reduction amount.": "El valor real de sus créditos, en particular los obtenidos a través de programas de evaluación, escuelas de oficios, educación militar y escuelas no norteamericanas, por ejemplo, se evaluará y verificará manualmente, y puede afectar el monto de reducción de matrícula y tarifas.",
    "Institution name": "Nombre de la Institución",
    "Institution city": "Ciudad de la Institución",
    "Institution country": "País de la Institución",
    "Degree earned": "Título obtenido",
    "Work history": "Historial laboral",
    "Are you currently employed?": "¿Está empleado actualmente?",
    "Your employer may have a partnership with us OR may help pay for your education.": "Es posible que su empleador tenga una sociedad con nosotros o que ayude a pagar su educación.",
    "Upload your resume": "Sube tu currículum/hoja de vida",
    "Students applying for the graduate program must also submit an updated version of their resume plus a personal statement that describes the applicant’s professional accomplishments and goals. Please include all this information in a single pdf file.": "Los estudiantes que solicitan el programa de posgrado también deben enviar una versión actualizada de su currículum más una declaración personal que describa los logros y objetivos profesionales del solicitante. Por favor incluya toda esta información en un solo archivo pdf.",
    "Upload a file": "Subir archivo",
    "or drag and drop": "o arrastrar y soltar",
    "PDF up to 4MB": "PDF hasta 4MB",
    "Required documents": "Documentos necesarios",
    "Official Transcripts": "Transcripciones Oficiales",
    "Students applying for the undergraduate program must also submit a copy of their official transcripts from their High School and have achieved a minimum grade point average of at least 2.0 (4.0).": "Los estudiantes que solicitan el programa de pregrado también deben presentar una copia de sus transcripciones oficiales de su escuela secundaria y haber alcanzado un promedio mínimo de calificaciones de al menos 2.0 (4.0).",
    "High School Diploma / Bachelor's Diploma": "Diploma de escuela secundaria / Diploma de licenciatura",
    "Applicants seeking admission into the program of Bachelor in Science that have an Associate Degree diploma from a state licensed, a government recognized institution or an equivalent degree from a regionally accredited institution could be accepted for the completion program after comparing the two sets of curricula and conclude that the courses are eligible for transfer.": "Los solicitantes que busquen admisión en el programa de Licenciatura en Ciencias que tengan un diploma de Grado Asociado de una institución con licencia estatal, reconocida por el gobierno o un título equivalente de una institución acreditada regionalmente podrían ser aceptados para el programa de finalización después de comparar los dos conjuntos de planes de estudio y concluir que los cursos son elegibles para la transferencia.",
    "Valid ID / Passport": "Licencia de conducir de EE.UU válida / pasaporte",
    "If you reside in the US, please attach a copy of your Driver’s License. If you live outside the US, you need to attach a copy of your updated passport.": "Si reside en los EE. UU., adjunte una copia de su licencia de conducir. Si vive fuera de los EE. UU., debe adjuntar una copia de su pasaporte actualizado.",
    "Review application": "Revisar la aplicación",
    "You are almost done! Please now review your application, and make sure that all the information here is accurate.": "¡Estas casi listo! Ahora revise su solicitud y asegúrese de que toda la información aquí sea correcta.",
    "Email address": "Correo electrónico",
    "Phone number": "Número telefónico",
    "Street address": "Dirección",
    "Street address line 2": "Dirección, línea 2",
    "City": "Ciudad",
    "Zip code": "Código postal",
    "Edit": "Editar",
    "Drivers License/Passport (last 4)": "Licencia de conducir / pasaporte",
    "US Resident": "Residente / ciudadano de EE.UU",
    "Active or retired from the military?": "¿Activo o retirado de las fuerzas armadas?",
    "Civilian working in the military?": "¿Civil trabajando en el ejército?",
    "Program details": "Detalles sobre el programa",
    "Applying for": "Aplicando para",
    "Academic program": "Programa académico",
    "Concentration": "Concentración",
    "Program format": "Formato",
    "Tentative start date": "Fecha de inicio tentativa",
    "Education details": "Detalles educativos",
    "Education level": "Nivel educativo",
    "Highschool name": "Nombre de la escuela secundaria",
    "Highschool city": "Ciudad de la escuela secundaria",
    "Highschool country": "País de la escuela secundaria",
    "Highschool completed on": "Secundaria/bachillerato completada en",
    "Post-secondary school name": "Nombre de la escuela postsecundaria",
    "Post-secondary school city": "Ciudad de la escuela postsecundaria",
    "Post-secondary school country": "País de la escuela postsecundaria",
    "Employment information": "Informacion de empleo",
    "Employer name": "Nombre del empleador",
    "Job title": "Título profesional",
    "Resume": "Currículum/hoja de vida",
    "Highschool diploma / Post-secondary diploma": "Diploma de escuela secundaria / Diploma de licenciatura",
    "Driver's license / Passport": "Licencia de conducir / Pasaporte",
    "missing or not applicable": "falta o no aplica",
    "currently unemployed": "-",
    "Update": "Actualizar",
    "Dismiss": "Descartar",
    "Sign application": "Firmar aplicación",
    "I hereby acknowledge that I have read and understand the application above.": "Por la presente reconozco que he leído y entiendo la solicitud anterior.",
    "Please enter your full name *": "Por favor escriba su nombre completo *",
    "Please enter your email *": "Escribe su dirección de correo electrónico *",
    "Send verification code": "Envíe el código de verificación",
    "I acknowledge that I have read and understood the content of this document. I acknowledge that I electronically sign this document by clicking on the Sign button. I give my consent to the use of electronic communications and records related to this document.": "Reconozco que he leído y entendido el contenido de este documento. Reconozco que firmo electrónicamente este documento haciendo clic en el botón Firmar. Doy mi consentimiento para el uso de comunicaciones y registros electrónicos relacionados con este documento.",
    "Enter the verification code we emailed you": "Ingrese el código de verificación que le enviamos por correo electrónico",
    "The selected code is invalid.": "El código seleccionado no es válido.",
    "Pay & submit application": "Pagar y enviar aplicación",
    "You made it!": "¡Lo lograste!",
    "Your application is now ready to be submitted.": "Su solicitud ya está lista para ser enviada.",
    "In the next step, we will process your <b>non-refundable</b> application payment. If you do not have a card with you at the moment, you can skip this step by clicking the 'Skip Payment' button to submit your application without payment.": "En el siguiente paso, procesaremos el pago de su solicitud <b>no reembolsable</b>. Si no tiene una tarjeta con usted en este momento, puede omitir este paso haciendo clic en el botón 'Omitir pago' para enviar su solicitud sin pago.",
    "Skip Payment": "Omitir pago",
    "Please notice that if you skip the payment now, you are still responsible for the application fee. One of our representatives will contact you to collect the application fee before your application is accepted by the University.": "Tenga en cuenta que si omite el pago ahora, aún es responsable de la tarifa de aplicación. Uno de nuestros representantes se comunicará con usted para procesar el cobro de la aplicación antes de que la Universidad comience a trabajar en su solicitud.",
    "Pay and Submit": "Pagar y Enviar aplicación",
    "Application Completed!": "¡Aplicación completada!",
    "Your application has been sent and you should get a confirmation email shortly. If you have any addional questions, please contact us by dialing": "Su aplicación ha sido enviada y debería recibir un correo electrónico de confirmación en breve. Si tiene alguna pregunta adicional, contáctenos llamando al",
    "Application ID: ": "ID de aplicación: ",
    "Continue to www.urbe.university": "Continuar a www.urbe.university",
    "Application saved!": "Su aplicación ha sido guardada",
    "Please check your inbox. We sent you an email with your application link so that you can finish it later.": "Por favor revise su bandeja de entrada. Le enviamos un correo electrónico con el enlace de su aplicación para que pueda terminarla más tarde.",
    "Exit and continue later": "Salir y continuar más tarde",
    "Start a new application": "Iniciar una nueva aplicación",
    "Application Found!": "¡Aplicación encontrada!",
    "We have found your application. Please click the button below to continue the process.": "Hemos encontrado su aplicación. Por favor, haga clic en el botón de abajo para continuar con el proceso.",
    "Continue Application": "Continuar Aplicación",
    "If you would like to restart your application instead, please click the link below.": "Si desea reiniciar su aplicación, haga clic en el enlace a continuación.",
    "Start again": "Empezar de nuevo",
    "Please know that this will erase any progress made so far, and you will have to start from the beginning.": "Tenga en cuenta que esto borrará cualquier progreso realizado hasta el momento y tendrá que empezar desde el principio.",
    "Are you interested in applying for a student visa?": "¿Estás interesado en solicitar una visa de estudiante?",
    "Only check this box if you are interested on applying for a student visa.": "Marca esta casilla solo si estás interesado en solicitar una visa de estudiante.",
    "Yes. I am interested in applying for a student visa.": "Sí, estoy interesado en solicitar una visa de estudiante.",
    "Start Application": "Comenzar Applicacion"
}
